Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: བྱང་ཆུབ་སེམས་དཔའི་སེམས་དང་ལྷག་པའི་བསམ་པའི་བདག་ཉིད་ཆེ་བ་ནི་དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡང་དག་པར་བརྗོད་པའོ། །
en: All the greatness of the aspirations and superior motivations of bodhisattvas is described by the kalyāṇamitras.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བྱམས་པ་ཆེན་པོའི་སྟོབས་ནི་དགེ་བའི་བཤེས་གཉེན་ལས་བྱུང་བའོ། །
en: All the strength of the great love of the bodhisattvas comes from the kalyāṇamitras.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྙིང་རྗེ་ཆེན་པོའི་སྟོབས་ནི་དགེ་བའི་བཤེས་གཉེན་གྱིས་བསྐྱེད་པའོ། །
en: All the strength of the great compassion of the bodhisattvas is created by the kalyāṇamitras.

source: བྱང་ཆུབ་སེམས་དཔའི་དབང་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་བཟུང་བའོ། །
en: All the powers of the bodhisattvas are possessed by the kalyāṇamitras.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཡན་ལག་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་གྱིས་བསྐྱེད་པའོ། །
en: All the aspects of the bodhisattvas are created by the kalyāṇamitras.

source: བྱང་ཆུབ་སེམས་དཔའི་ཕན་པ་ཉེ་བར་བསྒྲུབ་པ་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་ལས་བྱུང་བའོ། །
en: All the benefits accomplished by the bodhisattvas come from the kalyāṇamitras.

source: རིགས་ཀྱི་བུ་དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡང་དག་པར་ཟིན་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་ངན་སོང་དུ་མི་ལྟུང་ངོ་། །
en: “Noble one, the bodhisattvas cared for by the kalyāṇamitras do not fall into the lower existences.

source: དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་བཟུང་བའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་ཐེག་པ་ཆེན་པོ་ལས་མྱི་ལྡོག་གོ །
en: The bodhisattvas in the care of the kalyāṇamitras do not turn away from the Mahāyāna.

source: དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་བསམ་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་བྱང་ཆུབ་སེམས་དཔའི་བསླབ་པ་དང་འགལ་བར་མྱི་བྱེད་དོ། །
en: The bodhisattvas who are in the thoughts of the kalyāṇamitras do not transgress the trainings.

source: དགེ་བའི་བཤེས་གཉེན་གྱིས་ཤིན་ཏུ་བསྲུངས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་སྡིག་པའི་གྲོགས་པོའི་ལག་ཏུ་མྱི་འདོང་ངོ་། །
en: The bodhisattvas guarded by kalyāṇamitras do not fall into the hands of bad companions.

source: དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་བསྐྱངས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ལས་ཉམས་པར་མི་འགྱུར་རོ། །
en: The bodhisattvas protected by kalyāṇamitras do not lapse from the Dharma of the bodhisattvas.

source: དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡང་དག་པར་ཟིན་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་སོ་སོའི་སྐྱེ་བོའི་ས་ལས་ཡོངས་སུ་འདའོ། །
en: The bodhisattvas being cared for by kalyāṇamitras transcend the level of ordinary beings.

source: དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་བསྲུངས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་སྐྱོན་མེད་པར་མི་འཇུག་གོ །
en: The bodhisattvas guarded by kalyāṇamitras do not engage in the faults of the śrāvakas and pratyeka­buddhas.

source: དགེ་བའི་བཤེས་གཉེན་གྱིས་བསྐྱངས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་འཇིག་རྟེན་ལས་མངོན་པར་འཕགས་པ་ཡིན་ནོ། །
en: The bodhisattvas protected by kalyāṇamitras rise above the world.

source: དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡང་དག་པར་བསྐྱེད་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་འཇིག་རྟེན་གྱི་ཆོས་ཀྱིས་མྱི་གོས་པ་ཡིན་ནོ། །
en: The bodhisattvas created by kalyāṇamitras are unstained by worldly qualities.

source: དགེ་བའི་བཤེས་གཉེན་བསྙེན་བཀུར་བའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་སྤྱོད་པ་ཐམས་ཅད་ལ་མི་འཁྲུལ་པར་སྤྱོད་པ་ཡིན་ནོ། །
en: The bodhisattvas who serve the kalyāṇamitras practice a conduct free of confusion.

source: དགེ་བའི་བཤེས་གཉེན་གྱིས་བསྒྲུབས་པའི་བྱང་ཆུབ་སེམས་དཔའི་རྣམས་ནི་བརྩམ་པ་ཐམས་ཅད་ལས་ཕྱིར་མི་ལྡོག་གོ །
en: The bodhisattvas accomplished by kalyāṇamitras do not turn away from all undertakings.

source: དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་བཟུང་བའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་ལས་དང་ཉོན་མོངས་པས་ཐུབ་པར་དཀའ་བ་ཡིན་ནོ། །
en: The bodhisattvas in the care of kalyāṇamitras are invincible to karma and kleśas.

source: དགེ་བའི་བཤེས་གཉེན་གྱི་སྟོབས་ཀྱིས་བརྟན་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་བདུད་ཐམས་ཅད་ཀྱིས་མི་ཐུབ་པ་ཡིན་ནོ། །
en: The bodhisattvas who are reliant on the strength of the kalyāṇamitras are invulnerable to all māras.

source: དགེ་བའི་བཤེས་གཉེན་གྱི་རྟེན་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་བྱང་ཆུབ་ཀྱི་ཡན་ལག་ཐམས་ཅད་ཀྱིས་རྣམ་པར་འཕེལ་ལོ། །
en: The bodhisattvas who remain dependent on kalyāṇamitras increase all the aspects of enlightenment.

source: རིགས་ཀྱི་བུ་དགེ་བའི་བཤེས་གཉེན་ནི་བསྒྲིབ་པར་འགྱུར་བའི་ཆོས་ཐམས་ཅད་ལས་རྣམ་པར་སྦྱོང་བའོ། །
en: Noble one, the kalyāṇamitras have purified all obscured qualities.

source: དགེ་བའི་བཤེས་གཉེན་ནི་སྡིག་ཏོ་ལས་རྣམ་པར་བཟློག་པའོ། །
en: The kalyāṇamitras have turned away from bad actions.

source: དགེ་བའི་བཤེས་གཉེན་ནི་མི་བྱ་བ་རྣམས་ཁོང་དུ་ཆུད་པར་བྱེད་པའོ། །
en: The kalyāṇamitras have understood what is not to be done.

source: བག་མེད་པའི་གནས་ལས་ཡང་དག་པར་བཟློག་པའོ། །
en: They have eliminated all states of carelessness.

source: མ་རིག་པའི་མུན་པ་རྣམ་པར་སེལ་བའོ། །
en: They have dispelled the darkness of ignorance.

source: ལྟ་བའི་འཆིང་བ་འཐུབ་པའོ། །
en: They have cut through the bondage of wrong views.

source: འཁོར་བའི་གྲོང་ཁྱེར་ནས་འདོན་པའོ། །
en: They have left the city of saṃsāra.

source: འཇིག་རྟེན་གྱི་གནས་འདོར་བར་བྱེད་པའོ། །
en: They have discarded worldly states.

source: བདུད་ཀྱི་ཞགས་པ་ལས་ཐར་བར་བྱེད་པའོ། །
en: They have become free from the noose of Māra.

source: སྡུག་བསྔལ་གྱི་ཟུག་རྔུ་འབྱིན་པའོ། །
en: They have pulled out the splinter of suffering.

source: མི་ཤེས་པའི་ཐིབས་པ་ལས་ཐར་བར་བྱེད་པའོ། །
en: They have been liberated from the wasteland of unknowing.

source: ལྟ་བའི་མྱ་ངན་ལས་ཡོངས་སུ་ཟློ་བའོ། །
en: They have eliminated the misery of wrong views.

source: སྲིད་པའི་ཆུ་བོ་ལས་སྒྲོལ་བའོ། །
en: They are freed from the river of existence.

source: འདོད་པའི་འདམ་ནས་འབྱིན་པའོ། །
en: They are extracted from the swamp of desire.

source: ལམ་མི་བདེ་བ་ནས་རྣམ་པར་ཟློག་པའོ། །
en: They have turned away from paths to unhappiness.

source: བྱང་ཆུབ་སེམས་དཔའི་ལམ་ཡང་དག་པར་སྟོན་པའོ། །
en: They teach the path of the bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་ཡི་དམ་ལ་གཞོག་པའོ། །
en: They maintain the resolve of the bodhisattva.

source: ནན་ཏན་ལ་རབ་ཏུ་འགོད་པའོ། །
en: They establish others in practice.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འགྲོ་བའི་ཕྱོགས་རབ་ཏུ་སྟོན་པའོ། །
en: They teach the direction for going to omniscience.

source: ཤེས་རབ་ཀྱི་མིག་རྣམ་པར་སྦྱོང་བའོ། །
en: They purify the eyes of wisdom.

source: བྱང་ཆུབ་ཀྱི་སེམས་རྣམ་པར་འཕེལ་བར་བྱེད་པའོ། །
en: They increase the aspiration to enlightenment.

source: སྙིང་རྗེ་ཆེན་པོ་ཡང་དག་པར་སྐྱེད་པའོ། །
en: They give rise to great compassion.

source: སྤྱོད་པ་ཡོངས་སུ་སྟོན་པའོ། །
en: They teach the conduct.

source: ཕ་རོལ་ཏུ་ཕྱིན་པའི་གདམས་ངག་རབ་ཏུ་སྟོན་པའོ། །
en: They teach the instructions for the perfections.

source: ས་ལ་རབ་ཏུ་འགོད་པའོ། །
en: They establish others on the bhūmis.

source: བཟོད་པ་རྣམ་པར་འབྱེད་པའོ། །
en: They elucidate patience.

source: དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཡོངས་སུ་འགྲུབ་པར་བྱེད་པའོ། །
en: They cause the accomplishment of all roots of merit.

source: ཚོགས་ཐམས་ཅད་སྐྱེད་པར་བྱེད་པའོ། །
en: They cause the development of all accumulations.

source: བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་ཐམས་ཅད་སྟོབས་པའོ། །
en: They bestow all the bodhisattva qualities.

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཞབས་ཀྱི་དྲུང་དུ་ཕྱིན་པར་བྱེད་པའོ། །
en: They enable going to the feet of all buddhas.

source: ཡོན་ཏན་ཐམས་ཅད་ཡོངས་སུ་སྟོན་པའོ། །
en: They teach all qualities.

source: དོན་ཐམས་ཅད་ཡང་དག་པར་ལེན་དུ་འཇུག་པའོ། །
en: They bring the acquisition of all benefits.

source: ནན་ཏན་ལ་གཟེངས་བསྟོད་པའོ། །
en: They inspire practice.

source: འབྱུང་བའི་སྒོ་སྟོན་པའོ། །
en: They reveal the door to setting forth.

source: ལམ་གོལ་བ་ལས་ཡོངས་སུ་སྲུང་བའོ། །
en: They guard others from taking wrong paths.

source: ཆོས་སྣང་བའི་སྒོ་སྣང་བར་བྱེད་པའོ། །
en: They bring illumination from the gateways to the light of the Dharma.

source: ཆོས་ཀྱི་སྒོ་མངོན་པར་བརླན་པར་བྱེད་པའོ། །
en: They bring saturation from the doors of the Dharma.

source: ཆོས་ཐོས་པར་བྱ་བའི་སྤྲིན་གྱི་ཆར་རབ་ཏུ་འབེབས་པའོ། །
en: They send down a rain from clouds of hearing the Dharma.

source: ཉོན་མོངས་པ་ཐམས་ཅད་ཞི་བར་བྱེད་པའོ། །
en: They cause all kleśas to cease.

source: ལྟ་བའི་རྣམ་པ་ཐམས་ཅད་ལས་རྣམ་པར་ཟློག་པའོ། །
en: They turn others away from all wrong views.

source: སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ལ་གནས་པར་བྱེད་པའོ། །
en: They establish others in all the Dharmas of the buddhas.

source: འདི་ལྟར་ཡང་རིགས་ཀྱི་བུ་དགེ་བའི་བཤེས་གཉེན་ནི་སངས་རྒྱས་ཀྱི་རིགས་སུ་སྐྱེས་པས་མ་ལྟ་བུའོ། །
en: “Noble one, in that way, the kalyāṇamitras are like mothers because they give birth to the family of the buddhas.

source: དགེ་བའི་བཤེས་གཉེན་ནི་ཕན་པ་རྒྱ་ཆེན་པོར་སྒྲུབ་པས་ཕ་ལྟ་བུའོ། །
en: The kalyāṇamitras are like fathers because they accomplish great benefits.

source: དགེ་བའི་བཤེས་གཉེན་ནི་སྡིག་པ་ཐམས་ཅད་ལས་སྲུང་བས་མ་མ་ལྟ་བུའོ། །
en: The kalyāṇamitras are like nannies because they guard from all bad actions.

source: དགེ་བའི་བཤེས་གཉེན་ནི་བྱང་ཆུབ་སེམས་དཔའི་བསླབ་པ་ཁོང་དུ་ཆུད་པར་བྱེད་པས་སློབ་དཔོན་ལྟ་བུའོ། །
en: The kalyāṇamitras are like teachers because they bring understanding of bodhisattva training.

source: དགེ་བའི་བཤེས་གཉེན་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ལམ་དུ་འཛུད་པས་ལམ་མཁན་ལྟ་བུའོ། །
en: The kalyāṇamitras are like guides because they bring others onto the bodhisattva path.

source: དགེ་བའི་བཤེས་གཉེན་ནི་ཉོན་མོངས་པའི་ནད་ལས་ཐར་བར་བྱེད་པས་སྨན་པ་ལྟ་བུའོ། །
en: The kalyāṇamitras are like doctors because they free others from the illness of the kleśas.

source: དགེ་བའི་བཤེས་གཉེན་ནི་ཡེ་ཤེས་ཀྱི་སྨན་རྣམ་པར་འཕེལ་བར་བྱེད་པས་གངས་རི་ལྟ་བུའོ། །
en: The kalyāṇamitras are like the Himalayas because they multiply the medicinal herbs of wisdom.

source: དགེ་བའི་བཤེས་གཉེན་ནི་འཇིགས་པ་ཐམས་ཅད་ལས་སྲུང་བས་དཔའ་བོ་ལྟ་བུའོ། །
en: The kalyāṇamitras are like heroes because they guard from all fears.

source: དགེ་བའི་བཤེས་གཉེན་ནི་འཁོར་བའི་ཆུ་བོ་ཆེན་པོ་ལས་སྒྲོལ་བས་མཉན་པ་ལྟ་བུའོ། །
en: The kalyāṇamitras are like ferry captain because they bring others across the great river of saṃsāra.

source: དགེ་བའི་བཤེས་གཉེན་ནི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་རིན་པོ་ཆེའི་གླིང་དུ་ཕྱིན་པར་བྱེད་པས་སྐྱབ་འཛིན་པ་ལྟ་བུའོ། །རིགས་ཀྱི་བུ་དེ་ལྟ་བས་ན་དེ་ལྟར་ཡིད་ལ་བྱ་བ་རྒྱུན་མ་ཆད་པས་ཁྱོད་ཀྱིས་དགེ་བའི་བཤེས་གཉེན་བསྙེན་པར་གྱིས་ཤིག །
en: The kalyāṇamitras are like sea captains because they take others to the island of the jewels of omniscient wisdom.

source: ཁུར་ཐམས་ཅད་བཀུར་བས་ཡོངས་སུ་མི་སྐྱོ་བའི་ཕྱིར་ས་ལྟ་བུའི་སེམས་དང་། མི་ཕྱེད་པའི་ཕྱིར་རྡོ་རྗེ་ལྟ་བུའི་སེམས་དང་སྡུག་བསྔལ་ཐམས་ཅད་ཀྱིས་མི་སྒུལ་བའི་ཕྱིར་འཁོར་ཡུག་ལྟ་བུའི་སེམས་དང་། ཅི་དགའ་བར་བཀའ་ཉན་པས་བྲན་ལྟ་བུའི་སེམས་དང་། ངག་ཐམས་ཅད་མི་གཅག་པས་སློབ་མ་ལྟ་བུའི་སེམས་དང་། ལས་ཐམས་ཅད་ཉམས་སུ་བླང་བ་ལ་མི་སྨད་པས་འཇིག་རྟེན་གྱི་བྲན་ལྟ་བུའི་སེམས་དང་། ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱིས་མི་སྐྱོ་བའི་ཕྱིར་མ་མ་ལྟ་བུའི་སེམས་དང་། བྱའོ་ཅོག་ལ་མཐུན་པར་གཟུང་བས་གཡོག་ལྟ་བུའི་སེམས་དང་། ང་རྒྱལ་དང་མཐོ་བའི་ང་རྒྱལ་སྤོང་བས་ཕྱག་དར་བ་ལྟ་བུའི་སེམས་དང་། དུས་དང་དུས་མ་ཡིན་པར་མཐོན་དམན་དུ་འགྱུར་བས་ཟླ་བ་ཉ་བ་ལྟ་བུའི་སེམས་དང་། མྱི་སྲུན་པ་ཐམས་ཅད་རྣམ་པར་སྤོང་བས་རྟ་ཅང་ཤེས་ལྟ་བུའི་སེམས་དང་། ཁུར་ལྕི་བ་བཀུར་བས་ཐེག་པ་ལྟ་བུའི་སེམས་དང་། དུལ་བ་དང་ཅང་ཤེས་ཀྱི་བསམ་པས་གླང་པོ་ལྟ་བུའི་སེམས་དང་། མྱི་སྒུལ་མྱི་བསྐྱོད་པས་རི་ལྟ་བུའི་སེམས་དང་། མི་ཁྲོ་བས་ཁྱི་ལྟ་བུའི་སེམས་དང་། ང་རྒྱལ་དང་དུས་མེད་པས་གདོལ་བ་ལྟ་བུའི་སེམས་དང་། དྲེགས་པ་ཐམས་ཅད་མེད་པས་ཁྱུ་མཆོག་རྭ་བཅད་པ་ལྟ་བུའི་སེམས་དང་། རློམ་སེམས་མེད་པས་མཚན་བུ་ལྟ་བུའི་སེམས་དང་། འགྲོ་ཞིང་འོང་བས་མི་སྐྱོ་བས་གྲུ་ལྟ་བུའི་སེམས་དང་། དགེ་བའི་བཤེས་གཉེན་གྱི་ངག་གི་མཐར་ཕྱིན་པར་བྱེད་པས་ཟམ་པ་ལྟ་བུའི་སེམས་དང་། དགེ་བའི་བཤེས་གཉེན་གྱི་ངོར་བལྟ་བས་བུ་མཛངས་པ་ལྟ་བུའི་སེམས་དང་། ཆོས་ཀྱི་རྒྱལ་པོའི་བཀའ་ལས་མི་འགལ་བར་བྱ་བས་རྒྱལ་པོ་གཞོན་ནུ་ལྟ་བུའི་སེམས་ཀྱིས་དགེ་བའི་བཤེས་གཉེན་ལ་བསྙེན་པར་བྱའོ། །
en: “Noble one, you should approach the kalyāṇamitras continuously, thinking in this way: You should approach the kalyāṇamitras with a mind like the earth for carrying all burdens without weariness, with a mind like a vajra because it is indestructible, with a mind like the Cakravāla mountain range because it is unaffected by any suffering, with a mind like a slave because it gladly obeys, with a mind like a pupil because it does not disobey instructions, with a mind like a slave of the world because it takes on all tasks without resentment, with a mind like a nanny because it is unwearied by any kleśa, with a mind like a servant because it is prepared to do any kind of work, with a mind like a street sweeper because it is devoid of pride and arrogance, with a mind like a full moon because it is lofty at the appropriate time and low at the inappropriate time, with a mind like a thoroughbred stallion because it is devoid of unruliness, with a mind like a carriage because it can carry a heavy load, with a mind like an elephant because it is tamed and well bred, with a mind like a mountain because it is immovable and unshakable, with a mind like a dog because it is not angered, with a mind like a caṇḍāla because it is without pride or egoism, with a mind like a hornless bull because it is without arrogance, with a mind like an in-house pupil because it has no haughtiness, with a mind like a boat because it is unwearied by coming and going, with a mind like a bridge because it reaches the conclusion of the kalyāṇamitra’s instruction, with a mind like an excellent son because it looks up at the face of the kalyāṇamitra, and with a mind like a prince because it does not disobey the king of the Dharma.

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་བདག་ལ་ནི་ནད་པར་འདུ་ཤེས་བསྐྱེད་དོ། །དགེ་བའི་བཤེས་གཉེན་ལ་ནི་སྨན་པའི་འདུ་ཤེས་དང་། གདམས་ངག་ལ་ནི་སྨན་གྱི་འདུ་ཤེས་དང་། ནན་ཏན་ཉམས་སུ་བླང་བ་ལ་ནི་ནད་འཚོ་བའི་འདུ་ཤེས་བསྐྱེད་པར་བྱའོ། །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་བདག་ལ་ནི་དྲོན་པོའི་འདུ་ཤེས་བསྐྱེད་པར་བྱའོ། །
en: “Noble one, you should think of yourself as a sick person, think of the kalyāṇamitra as a doctor, think of the instructions as medicine, and think of dedication to their practice as being healed from illness.

source: དགེ་བའི་བཤེས་གཉེན་ལ་ནི་ལམ་མཚོན་པའི་འདུ་ཤེས་དང་། གདམས་ངག་ལ་ནི་ལམ་གྱི་འདུ་ཤེས་དང་། ནན་ཏན་ལ་ནི་ཕྱོགས་བདེ་བར་འགྲོ་བའི་འདུ་ཤེས་བསྐྱེད་པར་བྱའོ། །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་བདག་ལ་ནི་ཕ་རོལ་ཏུ་འགྲོ་བའི་འདུ་ཤེས་བསྐྱེད་པར་བྱའོ། །
en: “Noble one, you should think of yourself as a traveler, think of the kalyāṇamitra as a guide, think of the instructions as the path, and think of their practice as traveling safely.

source: དགེ་བའི་བཤེས་གཉེན་ལ་ནི་མཉན་པའི་འདུ་ཤེས་དང་། རྗེས་སུ་བསྟན་པ་ལ་མུ་སྟེགས་ཀྱི་འདུ་ཤེས་དང་། ནན་ཏན་ལ་ནི་གྲུའི་འདུ་ཤེས་བསྐྱེད་པར་བྱའོ། །
en: “Noble one, you should think of yourself as someone crossing to the opposite shore, think of the kalyāṇamitra as a ferry captain, think of the teachings as the jetty, and think of their practice as the boat.

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་བདག་ལ་ནི་ཞིང་པའི་འདུ་ཤེས་བསྐྱེད་པར་བྱའོ། །དགེ་བའི་བཤེས་གཉེན་ལ་ནི་ཀླུའི་དབང་པོའི་འདུ་ཤེས་དང་། གདམས་ངག་ལ་ནི་ཆར་པའི་འདུ་ཤེས་དང་། ནན་ཏན་ལ་ནི་ལོ་ཏོག་འགྲུབ་པའི་འདུ་ཤེས་བསྐྱེད་པར་བྱའོ། །
en: “Noble one, you should think of yourself as a farmer, think of the kalyāṇamitra as a nāga lord, think of the instructions as rain, and think of their practice as cultivating a harvest.

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་བདག་ལ་ནི་དབུལ་པོའི་འདུ་ཤེས་བསྐྱེད་པར་བྱའོ། །དགེ་བའི་བཤེས་གཉེན་ལ་ནི་ངལ་བསོ་པོའི་འདུ་ཤེས་དང་། གདམས་ངག་ལ་ནི་ནོར་དང་དོན་གྱི་འདུ་ཤེས་དང་། ནན་ཏན་ལ་ནི་དབུལ་བ་སེལ་བའི་འདུ་ཤེས་བསྐྱེད་པར་བྱའོ། །
en: “Noble one, you should think of yourself as a poor person, think of the kalyāṇamitra as Vaiśravaṇa, think of the instructions as wealth and gifts, and think of their practice as becoming free from poverty.

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་བདག་ལ་ནི་སློབ་མའི་འདུ་ཤེས་བསྐྱེད་པར་བྱའོ། །དགེ་བའི་བཤེས་གཉེན་ལ་ནི་སློབ་དཔོན་གྱི་འདུ་ཤེས་དང་གདམས་ངག་ལ་ནི་བཟོ་བའི་འདུ་ཤེས་དང་། ནན་ཏན་ལ་ནི་བཟོ་ཁོང་དུ་ཆུད་པའི་འདུ་ཤེས་བསྐྱེད་པར་བྱའོ། །
en: “Noble one, you should think of yourself as a pupil, think of the kalyāṇamitra as a teacher, think of the instructions as the arts, and think of their practice as learning the arts.

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་བདག་ལ་ནི་འཇིགས་པའི་འདུ་ཤེས་བསྐྱེད་པར་བྱའོ། །དགེ་བའི་བཤེས་གཉེན་ལ་ནི་དཔའ་བོའི་འདུ་ཤེས་དང་། གདམས་ངག་ལ་ནི་མཚོན་ཆའི་འདུ་ཤེས་དང་། ནན་ཏན་ལ་ནི་དགྲ་སེལ་བའི་འདུ་ཤེས་བསྐྱེད་པར་བྱའོ། །
en: “Noble one, you should think of yourself as someone in danger, think of the kalyāṇamitra as a hero, think of the instructions as weapons, and think of their practice as the elimination of enemies.

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་བདག་ལ་ནི་ཚོང་བའི་འདུ་ཤེས་བསྐྱེད་པར་བྱའོ། །དགེ་བའི་བཤེས་གཉེན་ལ་ནི་སྐྱབ་འཛིན་པའི་འདུ་ཤེས་དང་། གདམས་ངག་ལ་ནི་རིན་པོ་ཆེའི་འདུ་ཤེས་དང་། ནན་ཏན་ལ་ནི་རིན་པོ་ཆེ་སྡུད་པའི་འདུ་ཤེས་བསྐྱེད་པར་བྱའོ། །
en: “Noble one, you should think of yourself as a merchant, think of the kalyāṇamitra as a sea captain, think of the instructions as jewels, and think of their practice as gathering jewels.

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་བདག་ལ་ནི་བུ་དམ་པའི་འདུ་ཤེས་བསྐྱེད་པར་བྱའོ། །དགེ་བའི་བཤེས་གཉེན་ལ་ནི་ཕ་མའི་འདུ་ཤེས་དང་། རྗེས་སུ་བསྟན་པ་ལ་ནི་རིགས་ཀྱི་བུའི་ཚུལ་གྱི་འདུ་ཤེས་དང་། ནན་ཏན་ལ་ནི་ཚུལ་མ་ཉམས་པའི་འདུ་ཤེས་བསྐྱེད་པར་བྱའོ། །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་བདག་ལ་ནི་རྒྱལ་པོ་གཞོན་ནུའི་འདུ་ཤེས་བསྐྱེད་པར་བྱའོ། །
en: “Noble one, you should think of yourself as a good son, think of the kalyāṇamitra as your parents, think of the instructions as the behavior of someone from a good family, and think of their practice as keeping to that good behavior.

source: དགེ་བའི་བཤེས་གཉེན་ལ་ནི་ཆོས་ཀྱི་རྒྱལ་པོ་དང་བློན་པོ་དམ་པའི་འདུ་ཤེས་དང་། གདམས་ངག་ལ་ནི་རྒྱལ་པོའི་ཁྲིམས་ཀྱི་འདུ་ཤེས་དང་། ནན་ཏན་ལ་ནི་ཡེ་ཤེས་ཀྱི་རྒྱལ་པོའི་ཅོད་པན་དང་རྒྱན་དང་། ཆོས་ཀྱི་ཐབས་མགོ་ལ་འཆིང་བ་དང་། ཆོས་ཀྱི་རྒྱལ་པོའི་གྲོང་ཁྱེར་ལ་རྣམ་པར་ལྟ་བའི་འདུ་ཤེས་བསྐྱེད་པར་བྱ་སྟེ།
en: “Noble one, you should think of yourself as a prince, think of the kalyāṇamitra as a Dharma king and the prime minister, think of the instructions as the king’s law, and think of their practice as looking at the crown and adornments of the king of wisdom, the turban of the Dharma bound upon his head, and the Dharma king’s city.

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་དེ་ལྟ་བུའི་འདུ་ཤེས་ཡིད་ལ་བྱ་བ་ཡོངས་སུ་སྒོམ་སྟེ། དགེ་བའི་བཤེས་གཉེན་རྣམས་ལ་ཉེ་བར་བསྙེན་པར་གྱིས་ཤིག །
en: “Noble one, you should approach the kalyāṇamitras meditating on those thoughts and perceptions of the kalyāṇamitras.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་དགེ་བའི་བཤེས་གཉེན་ལ་ལྷག་པའི་བསམ་པ་ཡོངས་སུ་དག་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་དགེ་བའི་བཤེས་གཉེན་གྱི་ངག་ཐམས་ཅད་ཉམས་སུ་ལེན་པའི་ཚེ། གངས་ཀྱི་རི་ལ་རྟེན་པའི་རྩྭ་དང་གེལ་བ་དང་། སྨན་དང་ནགས་ཚལ་ལྟ་བུར་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཀྱིས་རྣམ་པར་འཕེལ་ལོ། །
en: Noble one, it is because when a bodhisattva, who has a pure superior motivation toward the kalyāṇamitras, is practicing all the instructions of the kalyāṇamitras, all the bodhisattva’s roots of merit will increase like the grass, bushes, herbs, and forests that depend on the Himalayas.

source: རྒྱ་མཚོ་ཆེན་པོ་ཆུའི་སྣོད་དུ་གྱུར་པ་ལྟར་ཆོས་ཐམས་ཅད་ཀྱི་སྣོད་དུ་འགྱུར་རོ། །
en: The bodhisattva becomes a container of all Dharmas just as the great ocean is a container of water.

source: གང་ཆེན་མཚོ་ཆེན་པོ་རིན་པོ་ཆེ་མང་པོའི་འབྱུང་གནས་སུ་གྱུར་པ་ལྟར་ཡོན་ཏན་ཐམས་ཅད་ཀྱི་འབྱུང་གནས་སུ་འགྱུར་རོ། །
en: The bodhisattva becomes the source of many qualities just as the great ocean is a source of many jewels.

source: མྱེའི་དྲོད་ཀྱིས་གསེར་ཡོངས་སུ་འབྱང་བ་ལྟར་བྱང་ཆུབ་ཀྱི་སེམས་ཡོངས་སུ་བྱང་བར་འགྱུར་རོ། །
en: The bodhisattva purifies just as the heat of fire purifies gold.

source: རྒྱ་མཚོ་ཆེན་པོ་ལས་འཕགས་པའི་རི་རབ་ལྟར་འཇིག་རྟེན་ལས་མངོན་པར་འཕགས་པར་འགྱུར་རོ། །
en: The bodhisattva is higher than the world just as Sumeru is higher than the ocean.

source: པད་མོ་ལ་ཆུས་མྱི་ཆགས་པ་ལྟར་འཇིག་རྟེན་གྱི་ཆོས་ཀྱིས་མྱི་གོས་པར་འགྱུར་རོ། །
en: The bodhisattva is unstained by the worldly qualities just as water does not cling to lotuses.

source: རྒྱ་མཚོ་ཆེན་པོ་རོ་རུལ་པ་དང་མི་འགྲོགས་པ་ལྟར། སྤྱོད་པ་ངན་པ་ཐམས་ཅད་དང་མི་འགྲོགས་སོ། །
en: The bodhisattva does not keep company with bad behavior just as the ocean does not keep a corpse.

source: ཡུད་དུ་ཡར་གྱི་ཟླ་བ་ལྟར་ཆོས་དཀར་པོས་རྣམ་པར་འཕེལ་བར་འགྱུར་རོ། །
en: The bodhisattva increases good qualities just like the phase of the waxing moon.

source: འཛམ་བུའི་གླིང་སྣང་བར་བྱེད་པའི་ཉི་མ་ལྟར་ཆོས་ཀྱི་དབྱིངས་སུ་སྣང་བར་འགྱུར་རོ། །
en: The bodhisattva illuminates the realm of the Dharma just as the sun illuminates the world.

source: ཕ་མ་དང་འགྲོགས་པའི་བུ་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་གྱི་ལུས་ཐམས་ཅད་ཡང་དག་པར་སྐྱེ་བར་འགྱུར་རོ། །
en: The bodhisattva has bodies that are all born from prayer just as a son is associated with his parents.

source: དེ་ལྟར་མདོར་ན་རིགས་ཀྱི་བུ་དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་ངག་ལ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་ཡོན་ཏན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་བརྗོད་དུ་མེད་པ་ཕྲག་བཅུ་ནི་རབ་ཏུ་འཛིན་པར་འགྱུར་རོ། །
en: “In brief, noble one, the bodhisattvas who follow thus the instructions of the kalyāṇamitras possess uncountable millions of quintillions of qualities.

source: དེའི་ལྷག་པའི་བསམ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བཅུ་ནི་ཡོངས་སུ་སྦྱོང་བར་འགྱུར་རོ། །
en: They purify millions of quintillions of higher motivations.

source: བྱང་ཆུབ་སེམས་དཔའི་དབང་པོ་བྱ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བཅུ་ནི་རབ་ཏུ་འཕེལ་བར་འགྱུར་རོ། །
en: They increase millions of quintillions of bodhisattva powers.

source: བྱིན་གྱི་རླབས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བཅུ་ནི་རྣམ་པར་སྤྱོད་པར་འགྱུར་རོ། །
en: They purify millions of quintillions of empowerments.

source: སྒྲིབ་པའི་ཆོས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བཅུ་ནི་རྣམ་པར་སྦྱོང་བར་འགྱུར་རོ། །སྒྲིབ་པའི་ཆོས་གྲངས་མེད་པ་བརྒྱ་སྟོང་ཕྲག་བཅུ་ནི་ཡོངས་སུ་དག་པར་འགྱུར་རོ། །
en: They purify away millions of quintillions of obscurations.

source: བདུད་གྲངས་མེད་པ་བརྒྱ་སྟོང་ཕྲག་བཅུ་ལས་ནི་ཡང་དག་པར་འདས་པར་འགྱུར་རོ། །
en: They transcend millions of quintillions of māras.

source: ཆོས་ཀྱི་སྒོ་གྲངས་མེད་པ་བརྒྱ་སྟོང་ཕྲག་བཅུ་ལ་ནི་རབ་ཏུ་འཇུག་པར་འགྱུར་རོ། །
en: They enter millions of quintillions of Dharma gateways.

source: ཚོགས་རྣམ་པར་དག་པའི་སྒོ་གྲངས་མེད་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བཅུ་ནི་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །
en: They complete millions of quintillions of accumulations.

source: སྤྱོད་པ་གྲངས་མེད་པ་བརྒྱ་སྟོང་ཕྲག་བཅུ་ནི་ཀུན་ནས་དག་པར་འགྱུར་རོ། །
en: They purify millions of quintillions of conducts.

source: སྨོན་ལམ་ཆེན་པོ་གྲངས་མེད་པ་བརྒྱ་སྟོང་ཕྲག་བཅུ་ནི་མངོན་པར་གྲུབ་པར་འགྱུར་རོ། །རིགས་ཀྱི་བུ་དེ་ལྟར་མདོར་ན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་ཐམས་ཅད་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་དང་། བྱང་ཆུབ་སེམས་དཔའི་ས་ཐམས་ཅད་དང་།
en: They accomplish millions of quintillions of great prayers.

source: བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པ་ལ་འཇུག་པ་ཐམས་ཅད་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་ཐམས་ཅད་དང་། བྱང་ཆུབ་སེམས་དཔའི་མངོན་པར་ཤེས་པའི་ཡེ་ཤེས་ཀྱིས་རྣམ་པར་འཕྲུལ་པ་ཐམས་ཅད་དང་། བྱང་ཆུབ་སེམས་དཔའི་གཟུངས་དང་སྤོབས་པའི་སྣང་བ་ཐམས་ཅད་དང་། བྱང་ཆུབ་སེམས་དཔའི་བསྔོ་བའི་ཡེ་ཤེས་དང་མངོན་པར་ཤེས་པ་ཚད་མེད་པ་ཐམས་ཅད་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་མངོན་པར་བསྒྲུབ་པ་ཐམས་ཅད་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་རབ་ཏུ་ཐོབ་ཅིང་ཡོངས་སུ་གྲུབ་པ་རྣམས་ནི་དགེ་བའི་བཤེས་གཉེན་ལ་རག་ལས་པ་དག་གོ །དགེ་བའི་བཤེས་གཉེན་རྩ་བར་གྱུར་པ་དག་གོ །དགེ་བའི་བཤེས་གཉེན་ལས་བྱུང་བ་དག་གོ །དགེ་བའི་བཤེས་གཉེན་སྐྱེ་གནས་སུ་གྱུར་པ་དག་གོ །དགེ་བའི་བཤེས་གཉེན་སྐྱེ་མཆེད་དུ་གྱུར་པ་དག་གོ །དགེ་བའི་བཤེས་གཉེན་ལས་ཡོངས་སུ་སྐྱེས་པ་དག་གོ །དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་སྤེལ་བ་དག་གོ །དགེ་བའི་བཤེས་གཉེན་ལ་རབ་ཏུ་རྟེན་པ་དག་གོ །དགེ་བའི་བཤེས་གཉེན་རྒྱུར་གྱུར་པའོ། །དགེ་བའི་བཤེས་གཉེན་ལས་རབ་ཏུ་སྐྱེས་པ་དག་གོ །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་རྣམ་པ་དེ་ལྟ་བུའི་དགེ་བའི་བཤེས་གཉེན་གྱི་ཡོན་ཏན་དང་།
en: “Thus, noble one, in brief, all bodhisattva conduct, all bodhisattva perfections, all bodhisattva bhūmis, all bodhisattva entries into patience, all bodhisattva gateways to samādhi, all bodhisattva miraculous manifestations through the wisdom of higher cognition, all the bodhisattva illumination through mental retention and eloquence, all limitless ripened wisdom and higher cognition, all the accomplishment of bodhisattva prayers, and all attainment and accomplishment of buddha qualities depend on the kalyāṇamitras, have the kalyāṇamitras as their root, come from the kalyāṇamitras, have the kalyāṇamitras as their source, have the kalyāṇamitras as their origin, are born from the kalyāṇamitras, are increased by the kalyāṇamitras, are based on the kalyāṇamitras, have the kalyāṇamitras as their cause, and arise from the kalyāṇamitras.”
